[
    {
        "name": "Brian Jimenez",
        "role": "Managing Director of People, Caliber Public Schools",
        "quote": "Jack is an easy choice for any team seeking a results-driven, collaborative data scientist who elevates both projects and people. I recommend them without hesitation."
    },
    {
        "name": "Darrin Gilkerson",
        "role": "Software Engineer, QVT Financial",
        "quote": "Not only is Jack an extremely capable engineer and data scientist, they are also a collaborative team player who elevates everyone around them. I wholeheartedly recommend Jack for any data science position."
    },
    {
        "name": "Ollie Downs",
        "role": "Senior Data & Research Analyst, County of San Diego",
        "quote": "Jack is a sharp, human-first data person. They possess incredible passion for doing what is right and making good science happen."
    },
    {
        "name": "Sarah Nam",
        "role": "Senior Associate, Cancer Navigator",
        "quote": "They are a fast learner and willing to dig into new technologies. They would be a great addition to any team looking for a fast-learning and flexible data scientist."
    },
    {
        "name": "Danny Pan",
        "role": "Data Science Manager, SetSail",
        "quote": "I highly recommend Jack as a Data Scientist and Data Engineer for any organization. Their technical skill and work ethic will be immediately apparent upon joining any team."
    },
    {
        "name": "Josh Mantovani",
        "role": "Data Scientist / Engineer, SetSail",
        "quote": "Jack's expertise in data science, combined with their passion for software engineering, make them a valuable asset to any team. I highly recommend Jack for any data science or software developer role."
    },
    {
        "name": "G. Allen Ratliff",
        "role": "Assistant Professor of Social Work, UC Berkeley",
        "quote": "Jack is a motivated self-starter who loves to accomplish project tasks while developing and implementing smooth processes. Jack is a leader who uses imagination, experience, and empathy to create sustainable processes."
    },
    {
        "name": "Conan Minihan",
        "role": "Data Scientist, PhD Student",
        "quote": "Jack holds themself to the highest standard. Jack is a skilled coder and data scientist, with a wealth of geospatial analysis knowledge. They are a first rate leader, and an exceptional communicator."
    },
    {
        "name": "Eva Smolentseva",
        "role": "NLP Analyst, USAA",
        "quote": "Jack effortlessly evolved into a pillar of leadership and direction. Their work ethic and energy are contagiously inspiring. Jack is just one of those people that you want on your team in every scenario."
    }
]